### Terraform plan 
<details><summary>Click to see the plan</summary>


```diff

[command]/home/runner/work/_temp/6c02878f-30a7-41cf-af33-52a1a2a0e123/terraform-bin show -no-color plan.tmp

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["bottlerocket_add"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_add-2024042520272354410000003a/8ec78b78-7f27-f610-83a2-84118d064373"
        id                     = "aws-eks-cluster:bottlerocket_add-2024042520272354410000003a"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-bottlerocket_add-2024042520272354410000003a-8ec78b78-7f27-f610-83a2-84118d064373"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Name" = "bottlerocket_add"
        }
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["bottlerocket_custom"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_custom-20240425202723537300000036/5ac78b78-7f24-5315-de8f-7e031c8ef8e6"
        id                     = "aws-eks-cluster:bottlerocket_custom-20240425202723537300000036"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-bottlerocket_custom-20240425202723537300000036-5ac78b78-7f24-5315-de8f-7e031c8ef8e6"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Name" = "bottlerocket_custom"
        }
        # (6 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240425202723542900000038/acc78b78-7f2b-d517-a8ae-2f21a80669f1"
        id                     = "aws-eks-cluster:bottlerocket_default-20240425202723542900000038"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-bottlerocket_default-20240425202723542900000038-acc78b78-7f2b-d517-a8ae-2f21a80669f1"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Name" = "bottlerocket_default"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["complete"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/complete-eks-mng-2024042520272354900000003e/7cc78b78-7f28-05e8-72ee-bdb88c71e6f1"
        id                     = "aws-eks-cluster:complete-eks-mng-2024042520272354900000003e"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-complete-eks-mng-2024042520272354900000003e-7cc78b78-7f28-05e8-72ee-bdb88c71e6f1"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "ExtraTag" = "EKS managed node group complete"
            "Name"     = "complete-eks-mng"
        }
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["custom_ami"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/custom_ami-2024042520272354890000003c/92c78b78-7f29-35ee-fe92-a609d3bfcc12"
        id                     = "aws-eks-cluster:custom_ami-2024042520272354890000003c"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-custom_ami-2024042520272354890000003c-92c78b78-7f29-35ee-fe92-a609d3bfcc12"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Name" = "custom_ami"
        }
        # (6 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["default_node_group"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/default_node_group-20240425202723549400000040/68c78b78-7f2f-7211-9baa-0b5abc7b7398"
        id                     = "aws-eks-cluster:default_node_group-20240425202723549400000040"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-default_node_group-20240425202723549400000040-68c78b78-7f2f-7211-9baa-0b5abc7b7398"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Name" = "default_node_group"
        }
        # (9 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group_tag.cluster_autoscaler_label_tags["complete|label|GithubOrg"] will be created
  + resource "aws_autoscaling_group_tag" "cluster_autoscaler_label_tags" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)

      + tag {
          + key                 = "k8s.io/cluster-autoscaler/node-template/label/GithubOrg"
          + propagate_at_launch = false
          + value               = "terraform-aws-modules"
        }
    }

  # aws_autoscaling_group_tag.cluster_autoscaler_label_tags["complete|label|GithubRepo"] will be created
  + resource "aws_autoscaling_group_tag" "cluster_autoscaler_label_tags" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)

      + tag {
          + key                 = "k8s.io/cluster-autoscaler/node-template/label/GithubRepo"
          + propagate_at_launch = false
          + value               = "terraform-aws-eks"
        }
    }

  # aws_autoscaling_group_tag.cluster_autoscaler_label_tags["complete|taint|dedicated"] will be created
  + resource "aws_autoscaling_group_tag" "cluster_autoscaler_label_tags" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)

      + tag {
          + key                 = "k8s.io/cluster-autoscaler/node-template/taint/dedicated"
          + propagate_at_launch = false
          + value               = "gpuGroup:NoSchedule"
        }
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.10.1-eksbuild.7"
      + arn                         = (known after apply)
      + cluster_name                = "aws-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Name" = "aws-eks-cluster"
        }
      + tags_all                    = {
          + "Name" = "aws-eks-cluster"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.28.8-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "aws-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Name" = "aws-eks-cluster"
        }
      + tags_all                    = {
          + "Name" = "aws-eks-cluster"
        }

      + timeouts {}
    }

  # module.eks.module.eks_managed_node_group["bottlerocket_add"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_add-2024042520272354410000003a/8ec78b78-7f27-f610-83a2-84118d064373" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "aws-eks-cluster:bottlerocket_add-2024042520272354410000003a" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "bottlerocket_add-2024042520272354410000003a" -> (known after apply)
      ~ release_version        = "1.19.4-4f0a078e" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-bottlerocket_add-2024042520272354410000003a-8ec78b78-7f27-f610-83a2-84118d064373"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "bottlerocket_add"
        }
        # (8 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-075e17872fb2dd605"
          ~ name    = "bottlerocket_add-2024042520272314750000002e" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["bottlerocket_custom"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "CUSTOM" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_custom-20240425202723537300000036/5ac78b78-7f24-5315-de8f-7e031c8ef8e6" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "aws-eks-cluster:bottlerocket_custom-20240425202723537300000036" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "bottlerocket_custom-20240425202723537300000036" -> (known after apply)
      ~ release_version        = "ami-021fec93fc20fbe9d" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-bottlerocket_custom-20240425202723537300000036-5ac78b78-7f24-5315-de8f-7e031c8ef8e6"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "bottlerocket_custom"
        }
      + version                = (known after apply)
        # (6 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-069e40193d0496760"
          ~ name    = "bottlerocket_custom-20240425202723148700000030" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240425202723542900000038/acc78b78-7f2b-d517-a8ae-2f21a80669f1" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "aws-eks-cluster:bottlerocket_default-20240425202723542900000038" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "bottlerocket_default-20240425202723542900000038" -> (known after apply)
      ~ release_version        = "1.19.4-4f0a078e" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-bottlerocket_default-20240425202723542900000038-acc78b78-7f2b-d517-a8ae-2f21a80669f1"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "bottlerocket_default"
        }
        # (8 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["complete"].aws_autoscaling_schedule.this["scale-down"] will be created
  + resource "aws_autoscaling_schedule" "this" {
      + arn                    = (known after apply)
      + autoscaling_group_name = (known after apply)
      + desired_capacity       = 0
      + end_time               = "2024-03-05T12:00:00Z"
      + id                     = (known after apply)
      + max_size               = -1
      + min_size               = 0
      + recurrence             = "0 12 * * *"
      + scheduled_action_name  = "scale-down"
      + start_time             = "2023-03-05T12:00:00Z"
      + time_zone              = "Etc/GMT+0"
    }

  # module.eks.module.eks_managed_node_group["complete"].aws_autoscaling_schedule.this["scale-up"] will be created
  + resource "aws_autoscaling_schedule" "this" {
      + arn                    = (known after apply)
      + autoscaling_group_name = (known after apply)
      + desired_capacity       = 2
      + end_time               = "2024-03-05T00:00:00Z"
      + id                     = (known after apply)
      + max_size               = -1
      + min_size               = 2
      + recurrence             = "0 0 * * *"
      + scheduled_action_name  = "scale-up"
      + start_time             = "2023-03-05T00:00:00Z"
      + time_zone              = "Etc/GMT+0"
    }

  # module.eks.module.eks_managed_node_group["complete"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "CUSTOM" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/complete-eks-mng-2024042520272354900000003e/7cc78b78-7f28-05e8-72ee-bdb88c71e6f1" -> (known after apply)
      ~ capacity_type          = "SPOT" -> "ON_DEMAND"
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "aws-eks-cluster:complete-eks-mng-2024042520272354900000003e" -> (known after apply)
      ~ node_group_name        = "complete-eks-mng-2024042520272354900000003e" -> (known after apply)
      ~ release_version        = "ami-01520c51b1b0e680b" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-complete-eks-mng-2024042520272354900000003e-7cc78b78-7f28-05e8-72ee-bdb88c71e6f1"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "ExtraTag" = "EKS managed node group complete"
            "Name"     = "complete-eks-mng"
        }
      + version                = (known after apply)
        # (8 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-01e239d2632fe42eb"
          ~ name    = "complete-20240425202723153100000034" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["custom_ami"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "CUSTOM" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/custom_ami-2024042520272354890000003c/92c78b78-7f29-35ee-fe92-a609d3bfcc12" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "aws-eks-cluster:custom_ami-2024042520272354890000003c" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "custom_ami-2024042520272354890000003c" -> (known after apply)
      ~ release_version        = "ami-01af8560b504eb3db" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-custom_ami-2024042520272354890000003c-92c78b78-7f29-35ee-fe92-a609d3bfcc12"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "custom_ami"
        }
      + version                = (known after apply)
        # (6 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0084d750c366337e0"
          ~ name    = "custom_ami-20240425202723152800000032" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["default_node_group"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/default_node_group-20240425202723549400000040/68c78b78-7f2f-7211-9baa-0b5abc7b7398" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ id                     = "aws-eks-cluster:default_node_group-20240425202723549400000040" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "default_node_group-20240425202723549400000040" -> (known after apply)
      ~ release_version        = "1.28.5-20240415" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-default_node_group-20240425202723549400000040-68c78b78-7f2f-7211-9baa-0b5abc7b7398"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "default_node_group"
        }
        # (9 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 13 to add, 0 to change, 6 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_add"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_add-2024042520272354410000003a/8ec78b78-7f27-f610-83a2-84118d064373"%0A        id                     = "aws-eks-cluster:bottlerocket_add-2024042520272354410000003a"%0A      + resources              = [%0A          + {%0A              + autoscaling_groups              = [%0A                  + {%0A                      + name = "eks-bottlerocket_add-2024042520272354410000003a-8ec78b78-7f27-f610-83a2-84118d064373"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + status                 = "CREATE_FAILED"%0A        tags                   = {%0A            "Name" = "bottlerocket_add"%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_custom"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_custom-20240425202723537300000036/5ac78b78-7f24-5315-de8f-7e031c8ef8e6"%0A        id                     = "aws-eks-cluster:bottlerocket_custom-20240425202723537300000036"%0A      + resources              = [%0A          + {%0A              + autoscaling_groups              = [%0A                  + {%0A                      + name = "eks-bottlerocket_custom-20240425202723537300000036-5ac78b78-7f24-5315-de8f-7e031c8ef8e6"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + status                 = "CREATE_FAILED"%0A        tags                   = {%0A            "Name" = "bottlerocket_custom"%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240425202723542900000038/acc78b78-7f2b-d517-a8ae-2f21a80669f1"%0A        id                     = "aws-eks-cluster:bottlerocket_default-20240425202723542900000038"%0A      + resources              = [%0A          + {%0A              + autoscaling_groups              = [%0A                  + {%0A                      + name = "eks-bottlerocket_default-20240425202723542900000038-acc78b78-7f2b-d517-a8ae-2f21a80669f1"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + status                 = "CREATE_FAILED"%0A        tags                   = {%0A            "Name" = "bottlerocket_default"%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["complete"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/complete-eks-mng-2024042520272354900000003e/7cc78b78-7f28-05e8-72ee-bdb88c71e6f1"%0A        id                     = "aws-eks-cluster:complete-eks-mng-2024042520272354900000003e"%0A      + resources              = [%0A          + {%0A              + autoscaling_groups              = [%0A                  + {%0A                      + name = "eks-complete-eks-mng-2024042520272354900000003e-7cc78b78-7f28-05e8-72ee-bdb88c71e6f1"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + status                 = "CREATE_FAILED"%0A        tags                   = {%0A            "ExtraTag" = "EKS managed node group complete"%0A            "Name"     = "complete-eks-mng"%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["custom_ami"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/custom_ami-2024042520272354890000003c/92c78b78-7f29-35ee-fe92-a609d3bfcc12"%0A        id                     = "aws-eks-cluster:custom_ami-2024042520272354890000003c"%0A      + resources              = [%0A          + {%0A              + autoscaling_groups              = [%0A                  + {%0A                      + name = "eks-custom_ami-2024042520272354890000003c-92c78b78-7f29-35ee-fe92-a609d3bfcc12"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + status                 = "CREATE_FAILED"%0A        tags                   = {%0A            "Name" = "custom_ami"%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["default_node_group"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/default_node_group-20240425202723549400000040/68c78b78-7f2f-7211-9baa-0b5abc7b7398"%0A        id                     = "aws-eks-cluster:default_node_group-20240425202723549400000040"%0A      + resources              = [%0A          + {%0A              + autoscaling_groups              = [%0A                  + {%0A                      + name = "eks-default_node_group-20240425202723549400000040-68c78b78-7f2f-7211-9baa-0b5abc7b7398"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + status                 = "CREATE_FAILED"%0A        tags                   = {%0A            "Name" = "default_node_group"%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_autoscaling_group_tag.cluster_autoscaler_label_tags["complete|label|GithubOrg"] will be created%0A  + resource "aws_autoscaling_group_tag" "cluster_autoscaler_label_tags" {%0A      + autoscaling_group_name = (known after apply)%0A      + id                     = (known after apply)%0A%0A      + tag {%0A          + key                 = "k8s.io/cluster-autoscaler/node-template/label/GithubOrg"%0A          + propagate_at_launch = false%0A          + value               = "terraform-aws-modules"%0A        }%0A    }%0A%0A  # aws_autoscaling_group_tag.cluster_autoscaler_label_tags["complete|label|GithubRepo"] will be created%0A  + resource "aws_autoscaling_group_tag" "cluster_autoscaler_label_tags" {%0A      + autoscaling_group_name = (known after apply)%0A      + id                     = (known after apply)%0A%0A      + tag {%0A          + key                 = "k8s.io/cluster-autoscaler/node-template/label/GithubRepo"%0A          + propagate_at_launch = false%0A          + value               = "terraform-aws-eks"%0A        }%0A    }%0A%0A  # aws_autoscaling_group_tag.cluster_autoscaler_label_tags["complete|taint|dedicated"] will be created%0A  + resource "aws_autoscaling_group_tag" "cluster_autoscaler_label_tags" {%0A      + autoscaling_group_name = (known after apply)%0A      + id                     = (known after apply)%0A%0A      + tag {%0A          + key                 = "k8s.io/cluster-autoscaler/node-template/taint/dedicated"%0A          + propagate_at_launch = false%0A          + value               = "gpuGroup:NoSchedule"%0A        }%0A    }%0A%0A  # module.eks.aws_eks_addon.this["coredns"] will be created%0A  + resource "aws_eks_addon" "this" {%0A      + addon_name                  = "coredns"%0A      + addon_version               = "v1.10.1-eksbuild.7"%0A      + arn                         = (known after apply)%0A      + cluster_name                = "aws-eks-cluster"%0A      + configuration_values        = (known after apply)%0A      + created_at                  = (known after apply)%0A      + id                          = (known after apply)%0A      + modified_at                 = (known after apply)%0A      + preserve                    = true%0A      + resolve_conflicts_on_create = "OVERWRITE"%0A      + resolve_conflicts_on_update = "OVERWRITE"%0A      + tags                        = {%0A          + "Name" = "aws-eks-cluster"%0A        }%0A      + tags_all                    = {%0A          + "Name" = "aws-eks-cluster"%0A        }%0A%0A      + timeouts {}%0A    }%0A%0A  # module.eks.aws_eks_addon.this["kube-proxy"] will be created%0A  + resource "aws_eks_addon" "this" {%0A      + addon_name                  = "kube-proxy"%0A      + addon_version               = "v1.28.8-eksbuild.2"%0A      + arn                         = (known after apply)%0A      + cluster_name                = "aws-eks-cluster"%0A      + configuration_values        = (known after apply)%0A      + created_at                  = (known after apply)%0A      + id                          = (known after apply)%0A      + modified_at                 = (known after apply)%0A      + preserve                    = true%0A      + resolve_conflicts_on_create = "OVERWRITE"%0A      + resolve_conflicts_on_update = "OVERWRITE"%0A      + tags                        = {%0A          + "Name" = "aws-eks-cluster"%0A        }%0A      + tags_all                    = {%0A          + "Name" = "aws-eks-cluster"%0A        }%0A%0A      + timeouts {}%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_add"].aws_eks_node_group.this[0] is tainted, so must be replaced%0A+/- resource "aws_eks_node_group" "this" {%0A      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_add-2024042520272354410000003a/8ec78b78-7f27-f610-83a2-84118d064373" -> (known after apply)%0A      ~ capacity_type          = "ON_DEMAND" -> (known after apply)%0A      ~ disk_size              = 0 -> (known after apply)%0A      ~ id                     = "aws-eks-cluster:bottlerocket_add-2024042520272354410000003a" -> (known after apply)%0A      - labels                 = {} -> null%0A      ~ node_group_name        = "bottlerocket_add-2024042520272354410000003a" -> (known after apply)%0A      ~ release_version        = "1.19.4-4f0a078e" -> (known after apply)%0A      ~ resources              = [%0A          - {%0A              - autoscaling_groups              = [%0A                  - {%0A                      - name = "eks-bottlerocket_add-2024042520272354410000003a-8ec78b78-7f27-f610-83a2-84118d064373"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> (known after apply)%0A      ~ status                 = "CREATE_FAILED" -> (known after apply)%0A        tags                   = {%0A            "Name" = "bottlerocket_add"%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A      ~ launch_template {%0A            id      = "lt-075e17872fb2dd605"%0A          ~ name    = "bottlerocket_add-2024042520272314750000002e" -> (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      ~ update_config {%0A          - max_unavailable            = 0 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_custom"].aws_eks_node_group.this[0] is tainted, so must be replaced%0A+/- resource "aws_eks_node_group" "this" {%0A      ~ ami_type               = "CUSTOM" -> (known after apply)%0A      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_custom-20240425202723537300000036/5ac78b78-7f24-5315-de8f-7e031c8ef8e6" -> (known after apply)%0A      ~ capacity_type          = "ON_DEMAND" -> (known after apply)%0A      ~ disk_size              = 0 -> (known after apply)%0A      ~ id                     = "aws-eks-cluster:bottlerocket_custom-20240425202723537300000036" -> (known after apply)%0A      - labels                 = {} -> null%0A      ~ node_group_name        = "bottlerocket_custom-20240425202723537300000036" -> (known after apply)%0A      ~ release_version        = "ami-021fec93fc20fbe9d" -> (known after apply)%0A      ~ resources              = [%0A          - {%0A              - autoscaling_groups              = [%0A                  - {%0A                      - name = "eks-bottlerocket_custom-20240425202723537300000036-5ac78b78-7f24-5315-de8f-7e031c8ef8e6"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> (known after apply)%0A      ~ status                 = "CREATE_FAILED" -> (known after apply)%0A        tags                   = {%0A            "Name" = "bottlerocket_custom"%0A        }%0A      + version                = (known after apply)%0A        # (6 unchanged attributes hidden)%0A%0A      ~ launch_template {%0A            id      = "lt-069e40193d0496760"%0A          ~ name    = "bottlerocket_custom-20240425202723148700000030" -> (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      ~ update_config {%0A          - max_unavailable            = 0 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] is tainted, so must be replaced%0A+/- resource "aws_eks_node_group" "this" {%0A      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240425202723542900000038/acc78b78-7f2b-d517-a8ae-2f21a80669f1" -> (known after apply)%0A      ~ capacity_type          = "ON_DEMAND" -> (known after apply)%0A      ~ disk_size              = 20 -> (known after apply)%0A      ~ id                     = "aws-eks-cluster:bottlerocket_default-20240425202723542900000038" -> (known after apply)%0A      - labels                 = {} -> null%0A      ~ node_group_name        = "bottlerocket_default-20240425202723542900000038" -> (known after apply)%0A      ~ release_version        = "1.19.4-4f0a078e" -> (known after apply)%0A      ~ resources              = [%0A          - {%0A              - autoscaling_groups              = [%0A                  - {%0A                      - name = "eks-bottlerocket_default-20240425202723542900000038-acc78b78-7f2b-d517-a8ae-2f21a80669f1"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> (known after apply)%0A      ~ status                 = "CREATE_FAILED" -> (known after apply)%0A        tags                   = {%0A            "Name" = "bottlerocket_default"%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A      ~ update_config {%0A          - max_unavailable            = 0 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["complete"].aws_autoscaling_schedule.this["scale-down"] will be created%0A  + resource "aws_autoscaling_schedule" "this" {%0A      + arn                    = (known after apply)%0A      + autoscaling_group_name = (known after apply)%0A      + desired_capacity       = 0%0A      + end_time               = "2024-03-05T12:00:00Z"%0A      + id                     = (known after apply)%0A      + max_size               = -1%0A      + min_size               = 0%0A      + recurrence             = "0 12 * * *"%0A      + scheduled_action_name  = "scale-down"%0A      + start_time             = "2023-03-05T12:00:00Z"%0A      + time_zone              = "Etc/GMT+0"%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["complete"].aws_autoscaling_schedule.this["scale-up"] will be created%0A  + resource "aws_autoscaling_schedule" "this" {%0A      + arn                    = (known after apply)%0A      + autoscaling_group_name = (known after apply)%0A      + desired_capacity       = 2%0A      + end_time               = "2024-03-05T00:00:00Z"%0A      + id                     = (known after apply)%0A      + max_size               = -1%0A      + min_size               = 2%0A      + recurrence             = "0 0 * * *"%0A      + scheduled_action_name  = "scale-up"%0A      + start_time             = "2023-03-05T00:00:00Z"%0A      + time_zone              = "Etc/GMT+0"%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["complete"].aws_eks_node_group.this[0] is tainted, so must be replaced%0A+/- resource "aws_eks_node_group" "this" {%0A      ~ ami_type               = "CUSTOM" -> (known after apply)%0A      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/complete-eks-mng-2024042520272354900000003e/7cc78b78-7f28-05e8-72ee-bdb88c71e6f1" -> (known after apply)%0A      ~ capacity_type          = "SPOT" -> "ON_DEMAND"%0A      ~ disk_size              = 0 -> (known after apply)%0A      ~ id                     = "aws-eks-cluster:complete-eks-mng-2024042520272354900000003e" -> (known after apply)%0A      ~ node_group_name        = "complete-eks-mng-2024042520272354900000003e" -> (known after apply)%0A      ~ release_version        = "ami-01520c51b1b0e680b" -> (known after apply)%0A      ~ resources              = [%0A          - {%0A              - autoscaling_groups              = [%0A                  - {%0A                      - name = "eks-complete-eks-mng-2024042520272354900000003e-7cc78b78-7f28-05e8-72ee-bdb88c71e6f1"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> (known after apply)%0A      ~ status                 = "CREATE_FAILED" -> (known after apply)%0A        tags                   = {%0A            "ExtraTag" = "EKS managed node group complete"%0A            "Name"     = "complete-eks-mng"%0A        }%0A      + version                = (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A      ~ launch_template {%0A            id      = "lt-01e239d2632fe42eb"%0A          ~ name    = "complete-20240425202723153100000034" -> (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      ~ update_config {%0A          - max_unavailable            = 0 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["custom_ami"].aws_eks_node_group.this[0] is tainted, so must be replaced%0A+/- resource "aws_eks_node_group" "this" {%0A      ~ ami_type               = "CUSTOM" -> (known after apply)%0A      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/custom_ami-2024042520272354890000003c/92c78b78-7f29-35ee-fe92-a609d3bfcc12" -> (known after apply)%0A      ~ capacity_type          = "ON_DEMAND" -> (known after apply)%0A      ~ disk_size              = 0 -> (known after apply)%0A      ~ id                     = "aws-eks-cluster:custom_ami-2024042520272354890000003c" -> (known after apply)%0A      - labels                 = {} -> null%0A      ~ node_group_name        = "custom_ami-2024042520272354890000003c" -> (known after apply)%0A      ~ release_version        = "ami-01af8560b504eb3db" -> (known after apply)%0A      ~ resources              = [%0A          - {%0A              - autoscaling_groups              = [%0A                  - {%0A                      - name = "eks-custom_ami-2024042520272354890000003c-92c78b78-7f29-35ee-fe92-a609d3bfcc12"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> (known after apply)%0A      ~ status                 = "CREATE_FAILED" -> (known after apply)%0A        tags                   = {%0A            "Name" = "custom_ami"%0A        }%0A      + version                = (known after apply)%0A        # (6 unchanged attributes hidden)%0A%0A      ~ launch_template {%0A            id      = "lt-0084d750c366337e0"%0A          ~ name    = "custom_ami-20240425202723152800000032" -> (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      ~ update_config {%0A          - max_unavailable            = 0 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["default_node_group"].aws_eks_node_group.this[0] is tainted, so must be replaced%0A+/- resource "aws_eks_node_group" "this" {%0A      ~ arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/default_node_group-20240425202723549400000040/68c78b78-7f2f-7211-9baa-0b5abc7b7398" -> (known after apply)%0A      ~ capacity_type          = "ON_DEMAND" -> (known after apply)%0A      ~ id                     = "aws-eks-cluster:default_node_group-20240425202723549400000040" -> (known after apply)%0A      - labels                 = {} -> null%0A      ~ node_group_name        = "default_node_group-20240425202723549400000040" -> (known after apply)%0A      ~ release_version        = "1.28.5-20240415" -> (known after apply)%0A      ~ resources              = [%0A          - {%0A              - autoscaling_groups              = [%0A                  - {%0A                      - name = "eks-default_node_group-20240425202723549400000040-68c78b78-7f2f-7211-9baa-0b5abc7b7398"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            },%0A        ] -> (known after apply)%0A      ~ status                 = "CREATE_FAILED" -> (known after apply)%0A        tags                   = {%0A            "Name" = "default_node_group"%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A      ~ update_config {%0A          - max_unavailable            = 0 -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0APlan: 13 to add, 0 to change, 6 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
 

```
</details>
